app/controllers/students_controller.rb

  def show
    @student = Student.find(params[:"id"])
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]